run/033-lbe-metal-vapour/0/Y_Pb_g
FoamFile {version 2.0; format ascii; class volScalarField; object Y_Pb_g;}
dimensions    [0 0 0 0 0 0 0];
internalField uniform 0;
boundaryField {
  INLET     {type zeroGradient;}
  OUTLET    {type zeroGradient;}
  WALL      {type zeroGradient;}
  FRONTBACK {type empty;}
}
