run/033-lbe-metal-vapour/Allrun
#!/bin/bash
# Generate frozen fields and run a copy of the tracked inputs.
set -euo pipefail
cd -- "$(dirname -- "$0")"
export LESTO_REPO=$(cd ../.. && pwd)
: "${LESTO_M10D_DATA:?Set to external tables generated by make_wall_tables.py}"
: "${FOAM_USER_APPBIN:?Load OpenFOAM and build rhoFixedFlowFoam first}"
for name in pv_Pb_phases.csv pv_Bi_phases.csv pv_Bi2_phases.csv pv_PbI2_phases.csv pv_BiI3_phases.csv logK_BiI_disp.csv log10Kf_PbBiI.csv
do test -f "$LESTO_M10D_DATA/$name"; done
mkdir -p work/bin
cp -r "$LESTO_REPO/applications/rhoFixedFlowFoam/tests/phaseChange/makeCarrier" work/
(cd work/makeCarrier && wclean && FOAM_USER_APPBIN=$PWD/../bin wmake) > work/log.carrier 2>&1
python3 - <<'PY'
from pathlib import Path
import shutil
p=Path('work/case')
if p.exists():shutil.rmtree(p)
for name in ['0','constant','system']:shutil.copytree(name,p/name)
PY
(cd work/case && blockMesh > log.blockMesh 2>&1 && ../bin/makeCarrier > log.carrier 2>&1 \
 && "$FOAM_USER_APPBIN/rhoFixedFlowFoam" > log.solver 2>&1)
echo 'Results: work/case/postProcessing; log: work/case/log.solver'
