run/033-lbe-metal-vapour/constant/thermochemistryProperties
FoamFile {version 2.0; format ascii; class dictionary; object thermochemistryProperties;}

model HKS;
pairs {PbI2_g {condensed PbI2_s; HKS {accommodation 1; Ce 1; kineticScale 1;} vapourPressure {file "$LESTO_M10D_DATA/pv_PbI2_phases.csv"; phases ("PbI2(cr)" "PbI2(l)"); units log10Pa;}}BiI3_g {condensed BiI3_s; HKS {accommodation 1; Ce 1; kineticScale 1;} vapourPressure {file "$LESTO_M10D_DATA/pv_BiI3_phases.csv"; phases ("BiI3(cr)" "BiI3(l)"); units log10Pa;}}}
interface {patches (WALL);}
HKSCoeffs {accommodation 1; Ce 1; kineticScale 1;}
samples {}
balance {nGuard 8; guardTolerance 1e-13; writeExchangeField yes;}
profiles {axis (1 0 0); origin (0 0 0); observable wall;
 bins {native {min 0; max .1; nBins 200;}}
 onset {fraction .001; searchFrom .02;}
}
respeciation {engine kernel; species (Pb_g PbI_g PbI2_g Bi_g Bi2_g BiI_g BiI3_g I_g I2_g);
 formationConstants "$LESTO_M10D_DATA/log10Kf_PbBiI.csv"; minTemperature 350; updateInterval 1;}
wallChannels {Pb {reactant Pb_g; condensed Pb_s; stoichiometry 1; vapourPressure {file "$LESTO_M10D_DATA/pv_Pb_phases.csv"; phases ("Pb(cr)" "Pb(l)"); units log10Pa;}}
Bi {reactant Bi_g; condensed Bi_s; stoichiometry 1; vapourPressure {file "$LESTO_M10D_DATA/pv_Bi_phases.csv"; phases ("Bi(cr)" "Bi(l)"); units log10Pa;}}
Bi2 {reactant Bi2_g; condensed Bi_s; stoichiometry 2; vapourPressure {file "$LESTO_M10D_DATA/pv_Bi2_phases.csv"; phases ("Bi(cr)" "Bi(l)"); units log10Pa;}}
BiI {reactant BiI_g; condensed Bi_s; stoichiometry {BiI_g -3; Bi_s 2; BiI3_g 1;} equilibrium {file "$LESTO_M10D_DATA/logK_BiI_disp.csv"; column logK;} reversible no;}
}
gasSources {boat {amounts {Pb_g 1.0566049834695684e-10; Bi_g 3.1108062656492792e-10; I_g 1.6222679780649104e-10;}
 box ((.01 0 -1) (.02 .0048 1)); startTime 0; duration 2;}}
